; domain
(define (domain blocksworld)
  (:requirements :strips :constraints :negative-preconditions)
  (:predicates (clear ?x)
               (on-table ?x)
               (arm-empty)
               (holding ?x)
               (on ?x ?y))

  (:action pickup
    :parameters (?ob)
    :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
    :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob)) 
                 (not (arm-empty))))

  (:action putdown
    :parameters  (?ob)
    :precondition (holding ?ob)
    :effect (and (clear ?ob) (arm-empty) (on-table ?ob) 
                 (not (holding ?ob))))

  (:action stack
    :parameters  (?ob ?underob)
    :precondition (and (clear ?underob) (holding ?ob))
    :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
                 (not (clear ?underob)) (not (holding ?ob))))

  (:action unstack
    :parameters  (?ob ?underob)
    :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
    :effect (and (holding ?ob) (clear ?underob)
                 (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem BW-rand-14)
(:domain blocksworld)
(:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 )
(:init
(arm-empty)
(on b1 b12)
(on b2 b6)
(on-table b3)
(on b4 b14)
(on b5 b9)
(on-table b6)
(on b7 b10)
(on b8 b4)
(on b9 b3)
(on-table b10)
(on b11 b5)
(on-table b12)
(on b13 b8)
(on b14 b1)
(clear b2)
(clear b7)
(clear b11)
(clear b13)
)
(:goal
(and
(on-table b1)
(on b2 b7)
(on b3 b13)
(on-table b4)
(on-table b5)
(on b6 b9)
(on b7 b1)
(on b8 b6)
(on b9 b5)
(on b10 b12)
(on b11 b2)
(on-table b12)
(on b13 b11)
(on b14 b10))
)
)

; plan
1. (unstack b2 b6)
   deleted: (on b2 b6) (clear b2) (arm-empty)
   added: (holding b2) (clear b6)
   goals met: 1 of 14
2. (stack b2 b7)
   deleted: (clear b7) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b7)
   goals met: 2 of 14
3. (unstack b13 b8)
   deleted: (on b13 b8) (clear b13) (arm-empty)
   added: (holding b13) (clear b8)
   goals met: 2 of 14
4. (stack b13 b11)
   deleted: (clear b11) (holding b13)
   added: (arm-empty) (clear b13) (on b13 b11)
   goals met: 3 of 14
5. (unstack b8 b4)
   deleted: (on b8 b4) (clear b8) (arm-empty)
   added: (holding b8) (clear b4)
   goals met: 3 of 14
6. (stack b8 b6)
   deleted: (clear b6) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b6)
   goals met: 4 of 14
7. (unstack b4 b14)
   deleted: (on b4 b14) (clear b4) (arm-empty)
   added: (holding b4) (clear b14)
   goals met: 4 of 14
8. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 5 of 14
9. (unstack b14 b1)
   deleted: (on b14 b1) (clear b14) (arm-empty)
   added: (holding b14) (clear b1)
   goals met: 5 of 14
10. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 5 of 14
11. (unstack b1 b12)
   deleted: (on b1 b12) (clear b1) (arm-empty)
   added: (holding b1) (clear b12)
   goals met: 5 of 14
12. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 6 of 14
13. (unstack b2 b7)
   deleted: (on b2 b7) (clear b2) (arm-empty)
   added: (holding b2) (clear b7)
   goals met: 5 of 14
14. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 5 of 14
15. (unstack b7 b10)
   deleted: (on b7 b10) (clear b7) (arm-empty)
   added: (holding b7) (clear b10)
   goals met: 5 of 14
16. (stack b7 b1)
   deleted: (clear b1) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b1)
   goals met: 6 of 14
17. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 6 of 14
18. (stack b2 b7)
   deleted: (clear b7) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b7)
   goals met: 7 of 14
19. (pickup b14)
   deleted: (clear b14) (on-table b14) (arm-empty)
   added: (holding b14)
   goals met: 7 of 14
20. (stack b14 b10)
   deleted: (clear b10) (holding b14)
   added: (arm-empty) (clear b14) (on b14 b10)
   goals met: 8 of 14
21. (unstack b13 b11)
   deleted: (on b13 b11) (clear b13) (arm-empty)
   added: (holding b13) (clear b11)
   goals met: 7 of 14
22. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 7 of 14
23. (unstack b11 b5)
   deleted: (on b11 b5) (clear b11) (arm-empty)
   added: (holding b11) (clear b5)
   goals met: 7 of 14
24. (stack b11 b2)
   deleted: (clear b2) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b2)
   goals met: 8 of 14
25. (unstack b5 b9)
   deleted: (on b5 b9) (clear b5) (arm-empty)
   added: (holding b5) (clear b9)
   goals met: 8 of 14
26. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 9 of 14
27. (unstack b9 b3)
   deleted: (on b9 b3) (clear b9) (arm-empty)
   added: (holding b9) (clear b3)
   goals met: 9 of 14
28. (stack b9 b5)
   deleted: (clear b5) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b5)
   goals met: 10 of 14
29. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 10 of 14
30. (stack b3 b13)
   deleted: (clear b13) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b13)
   goals met: 11 of 14
31. (unstack b8 b6)
   deleted: (on b8 b6) (clear b8) (arm-empty)
   added: (holding b8) (clear b6)
   goals met: 10 of 14
32. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 10 of 14
33. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 10 of 14
34. (stack b6 b9)
   deleted: (clear b9) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b9)
   goals met: 11 of 14
35. (pickup b8)
   deleted: (clear b8) (on-table b8) (arm-empty)
   added: (holding b8)
   goals met: 11 of 14
36. (stack b8 b6)
   deleted: (clear b6) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b6)
   goals met: 12 of 14
37. (unstack b14 b10)
   deleted: (on b14 b10) (clear b14) (arm-empty)
   added: (holding b14) (clear b10)
   goals met: 11 of 14
38. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 11 of 14
39. (pickup b10)
   deleted: (clear b10) (on-table b10) (arm-empty)
   added: (holding b10)
   goals met: 11 of 14
40. (stack b10 b12)
   deleted: (clear b12) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b12)
   goals met: 12 of 14
41. (pickup b14)
   deleted: (clear b14) (on-table b14) (arm-empty)
   added: (holding b14)
   goals met: 12 of 14
42. (stack b14 b10)
   deleted: (clear b10) (holding b14)
   added: (arm-empty) (clear b14) (on b14 b10)
   goals met: 13 of 14
43. (unstack b3 b13)
   deleted: (on b3 b13) (clear b3) (arm-empty)
   added: (holding b3) (clear b13)
   goals met: 12 of 14
44. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 12 of 14
45. (pickup b13)
   deleted: (clear b13) (on-table b13) (arm-empty)
   added: (holding b13)
   goals met: 12 of 14
46. (stack b13 b11)
   deleted: (clear b11) (holding b13)
   added: (arm-empty) (clear b13) (on b13 b11)
   goals met: 13 of 14
47. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 13 of 14
48. (stack b3 b13)
   deleted: (clear b13) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b13)
   goals met: 14 of 14
